{"patterns":[
    
    {
        "title": "Crochet Ventilator Bonnet",
        "from": "Stoke &Staffordshire",
        "image": ["ss_vent_a.png"],
        "materials": "Medium 4 Yarn<br>Size 11 (3mm) Crochet Hook<br>Size 2.5mm Crochet Hook",
        "instructions": "Flap:<br><br><br>Make 12 chain<br>1st row: 1dc into 2nd chain from the hook, then 1 dc into every chain to the end (11dc). Turn<br>2nd row: 1chain.1dc into 5dc.2chain,miss 1 dc.1dc into remaining 5 dc. Turn<br>3rd row 1 chain 1 dc into 5 dc.1dc into 2 chain space. 1dc into remaining 5dc. Turn<br>4th row : 1 chain 1 dc into every dc to the end. Turn<br>5th to 12th row: Repeat 4th row eight times. Fasten off.<br><br><br>Bonnet:<br><br>Make 34 chain<br>1st row: 1dc into 2nd chain (1 chain, miss 1 chain,1 dc into next chain), repeat this to the end ( 17dc and 16 chain spaces) Turn.<br>2nd row: 1 chain, 1 dc into 1st dc ( 1 dc into chain space,1 chain, miss dc) Repeat this to the last chain space, 1 dc into chain space. 1 dc. into last dc Turn.<br>3rd row: 1 chain 1 dc into 1st dc (1 chain, miss dc 1 chain into chain space) repeat this to last dc 1dc. Turn<br>4th row: 1 chain 1 dc into 1st dc. 1 dc into chain space ( 2 chain, miss dc, 1 dc into chain space) Repeat this to the last dc. 1 dc. Turn,<br><br>Change to a 3mm hook<br><br>5th row: 1 chain, 1 dc into 1st dc. 2 dc into each chain space to last 2 dc. 1 dc into each (33 dc). Turn<br>6th row: 1 chain 1 dc into 1st dc,1 dc into next 11 dc. Turn<br>On these 12 dc work 8 rows. Fasten off.<br>Miss centre 9 dc. Rejoin yarn to next dc. dc to end ( 12 dc ). Turn On these 12 dc work 8 rows. Turn<br>1 chain. 1 dc into 11 dc. 1 dc into first dc of the last row of the flap, together with 12th dc of bonnet. 1 dc into the next 9 dc on the flap.<br>1 dc into last dc together with the 1 dc on the next set of 12 dc 1 dc into each dc to the end ( 33 dc ). Turn<br>1 chain 1 dc into each dc to the end. Turn\n Repeat the last row. Fasten off. Turn<br>Miss 12 dc. Rejoin yarn to next dc. 1 dc into that dc. 1 dc into the next 8 dc. Turn 1 chain 1 dc into each of these 9 dc.<br>Turn.<br>Repeat last row 4 more times. Turn<br>1 chain. 1 dc into 7 dc two together ( 8 dc )<br>Repeat last row until 2 dc remain.<br>Work 1 row<br>Fasten off.<br><br><br>Sew Up<br><br>With right side of bonnet facing, join yarn to the neck edge. 4 dc into edge of brim. 15 dc round bonnet to the brim.<br>4 dc into edge of brim.<br>Turn.<br>1 chain 1 dc into each dc to the end. Fasten off<br>Sew on a button to secure the flap and sew on ribbons.<br>"
    }
]}